In [6]:

import pandas as pd
import numpy as np

In [4]:
%pwd

'C:\\Users\\AMRESH SINGH\\amresh'

In [7]:
#Read data and describe it
df1 = pd.read_csv('titanic_dataset.csv')
print(type(df1))
print(df1.head())

<class 'pandas.core.frame.DataFrame'>
   Unnamed: 0  pclass  survived  \
0           0       1         1
1           1       1         1
2           2       1         0
3           3       1         0
4           4       1         0

                                              name  gender      age  sibsp  \
0                    Allen, Miss. Elisabeth Walton  female  29.0000      0
1                   Allison, Master. Hudson Trevor    male   0.9167      1
2                     Allison, Miss. Helen Loraine  female   2.0000      1
3             Allison, Mr. Hudson Joshua Creighton    male  30.0000      1
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.0000      1

   parch  ticket      fare    cabin embarked boat   body  \
0      0   24160  $211.34        B5        S    2    NaN
1      2  113781  $151.55   C22 C26        S   11    NaN
2      2  113781  $151.55   C22 C26        S  NaN    NaN
3      2  113781  $151.55   C22 C26        S  NaN  135.0
4      2  113781  $151.55   C22 C26        S  NaN    NaN

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON
3  Montreal, PQ / Chesterville, ON
4  Montreal, PQ / Chesterville, ON

In [5]:
#Read data and describe it
df1 = pd.read_csv('titanic_dataset.csv')
print(type(df1))
print(df1.head())

NameError: name 'pd' is not defined

In [13]:
#Find columns with missingdata
print(df1.describe(include= 'all'))

         Unnamed: 0       pclass     survived              name gender  \
count   1309.000000  1309.000000  1309.000000              1309   1309
unique          NaN          NaN          NaN              1307      2
top             NaN          NaN          NaN  Kelly, Mr. James   male
freq            NaN          NaN          NaN                 2    843
mean     654.000000     2.294882     0.381971               NaN    NaN
std      378.020061     0.837836     0.486055               NaN    NaN
min        0.000000     1.000000     0.000000               NaN    NaN
25%      327.000000     2.000000     0.000000               NaN    NaN
50%      654.000000     3.000000     0.000000               NaN    NaN
75%      981.000000     3.000000     1.000000               NaN    NaN
max     1308.000000     3.000000     1.000000               NaN    NaN

                age        sibsp        parch    ticket    fare        cabin  \
count   1046.000000  1309.000000  1309.000000      1309    1308          295
unique          NaN          NaN          NaN       929     263          186
top             NaN          NaN          NaN  CA. 2343  $8.05   C23 C25 C27
freq            NaN          NaN          NaN        11      60            6
mean      29.881135     0.498854     0.385027       NaN     NaN          NaN
std       14.413500     1.041658     0.865560       NaN     NaN          NaN
min        0.166700     0.000000     0.000000       NaN     NaN          NaN
25%       21.000000     0.000000     0.000000       NaN     NaN          NaN
50%       28.000000     0.000000     0.000000       NaN     NaN          NaN
75%       39.000000     1.000000     0.000000       NaN     NaN          NaN
max       80.000000     8.000000     9.000000       NaN     NaN          NaN

       embarked boat        body     home.dest
count      1307  486  121.000000           745
unique        3   27         NaN           369
top           S   13         NaN  New York, NY
freq        914   39         NaN            64
mean        NaN  NaN  160.809917           NaN
std         NaN  NaN   97.696922           NaN
min         NaN  NaN    1.000000           NaN
25%         NaN  NaN   72.000000           NaN
50%         NaN  NaN  155.000000           NaN
75%         NaN  NaN  256.000000           NaN
max         NaN  NaN  328.000000           NaN

In [14]:
#Find columns with missingdata
print(df1.isna().any())

Unnamed: 0    False
pclass        False
survived      False
name          False
gender        False
age            True
sibsp         False
parch         False
ticket        False
fare           True
cabin          True
embarked       True
boat           True
body           True
home.dest      True
dtype: bool

In [15]:
#Print shape of dataset
print(df1.shape)

(1309, 15)

In [8]:
print(df1.count())

Unnamed: 0    1309
pclass        1309
survived      1309
name          1309
gender        1309
age           1046
sibsp         1309
parch         1309
ticket        1309
fare          1308
cabin          295
embarked      1307
boat           486
body           121
home.dest      745
dtype: int64

In [9]:
#drop columns with more than 25% missing data

print(df1.columns)
df1 = df.dropna(axis = 1, thresh =(1309*0.75), inplace = True)

Index(['Unnamed: 0', 'pclass', 'survived', 'name', 'gender', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body',
       'home.dest'],
      dtype='object')

NameError: name 'df' is not defined

In [10]:
#drop columns having independent values(which do not affect the survival rate).
print(df1.columns)
df1.drop(columns = ['Unnamed: 0', 'name','ticket'], inplace =True)
print(df1.count())
print(df1.head())

Index(['Unnamed: 0', 'pclass', 'survived', 'name', 'gender', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body',
       'home.dest'],
      dtype='object')
pclass       1309
survived     1309
gender       1309
age          1046
sibsp        1309
parch        1309
fare         1308
cabin         295
embarked     1307
boat          486
body          121
home.dest     745
dtype: int64
   pclass  survived  gender      age  sibsp  parch      fare    cabin  \
0       1         1  female  29.0000      0      0  $211.34        B5
1       1         1    male   0.9167      1      2  $151.55   C22 C26
2       1         0  female   2.0000      1      2  $151.55   C22 C26
3       1         0    male  30.0000      1      2  $151.55   C22 C26
4       1         0  female  25.0000      1      2  $151.55   C22 C26

  embarked boat   body                        home.dest
0        S    2    NaN                     St Louis, MO
1        S   11    NaN  Montreal, PQ / Chesterville, ON
2        S  NaN    NaN  Montreal, PQ / Chesterville, ON
3        S  NaN  135.0  Montreal, PQ / Chesterville, ON
4        S  NaN    NaN  Montreal, PQ / Chesterville, ON

In [12]:
#check data types of all columns
print(df1.dtypes)

pclass         int64
survived       int64
gender        object
age          float64
sibsp          int64
parch          int64
fare          object
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [14]:
print(dir(df1.fare.str))
df1.fare.replace(r'\$','', regex = True, inplace = True)

['__class__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__frozen', '__ge__', '__getattribute__', '__getitem__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__iter__', '__le__', '__lt__', '__module__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__weakref__', '_freeze', '_get_series_list', '_is_categorical', '_make_accessor', '_orig', '_parent', '_validate', '_wrap_result', 'capitalize', 'cat', 'center', 'contains', 'count', 'decode', 'encode', 'endswith', 'extract', 'extractall', 'find', 'findall', 'get', 'get_dummies', 'index', 'isalnum', 'isalpha', 'isdecimal', 'isdigit', 'islower', 'isnumeric', 'isspace', 'istitle', 'isupper', 'join', 'len', 'ljust', 'lower', 'lstrip', 'match', 'normalize', 'pad', 'partition', 'repeat', 'replace', 'rfind', 'rindex', 'rjust', 'rpartition', 'rsplit', 'rstrip', 'slice', 'slice_replace', 'split', 'startswith', 'strip', 'swapcase', 'title', 'translate', 'upper', 'wrap', 'zfill']

In [17]:
#Change the data types of columen
print(df1.dtypes)
print(df1.fare.head())
df1.fare = df1.fare.astype('float64')
df1['fare'] = [str(data).replace('$','') for data in df1['fare']]

pclass         int64
survived       int64
gender        object
age          float64
sibsp          int64
parch          int64
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object
0    211.34
1    151.55
2    151.55
3    151.55
4    151.55
Name: fare, dtype: float64

In [19]:
#find columns still having missing/na values and also count of missing data
df1.isna().any()

pclass       False
survived     False
gender       False
age           True
sibsp        False
parch        False
fare         False
cabin         True
embarked      True
boat          True
body          True
home.dest     True
dtype: bool

In [20]:
#dump the dataframe to a csv file 'titanic_filtered.csv'.
df1.to_csv('titanic_result.csv')

In [22]:
df1.survived.replace({0:'D',1:'A'}, inplace = True)

,pclass,survived,gender,age,sibsp,parch,fare,cabin,embarked,boat,body,home.dest
0,1,A,female,29.0000,0,0,211.34,B5,S,2,NaN,"St Louis, MO"
1,1,A,male,0.9167,1,2,151.55,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,D,female,2.0000,1,2,151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,D,male,30.0000,1,2,151.55,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,D,female,25.0000,1,2,151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [23]:
df1.head()

,pclass,survived,gender,age,sibsp,parch,fare,cabin,embarked,boat,body,home.dest
0,1,A,female,29.0000,0,0,211.34,B5,S,2,NaN,"St Louis, MO"
1,1,A,male,0.9167,1,2,151.55,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,D,female,2.0000,1,2,151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,D,male,30.0000,1,2,151.55,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,D,female,25.0000,1,2,151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [25]:
df1.survived.value_counts()

D    809
A    500
Name: survived, dtype: int64

In [27]:
r = df1.groupby(['survived','gender'])
print(r)
print(r.groups)
print(r.size())

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000000009965358>
{('A', 'female'): Int64Index([   0,    6,    8,   11,   12,   13,   17,   18,   21,   23,
            ...
            1223, 1244, 1247, 1257, 1258, 1260, 1261, 1286, 1290, 1300],
           dtype='int64', length=339), ('A', 'male'): Int64Index([   1,    5,   14,   20,   22,   26,   29,   31,   37,   47,
            ...
            1196, 1228, 1232, 1233, 1236, 1238, 1240, 1254, 1256, 1277],
           dtype='int64', length=161), ('D', 'female'): Int64Index([   2,    4,  105,  169,  286,  365,  369,  381,  382,  411,
            ...
            1227, 1230, 1231, 1265, 1267, 1273, 1276, 1279, 1304, 1305],
           dtype='int64', length=127), ('D', 'male'): Int64Index([   3,    7,    9,   10,   15,   16,   19,   25,   30,   34,
            ...
            1296, 1297, 1298, 1299, 1301, 1302, 1303, 1306, 1307, 1308],
           dtype='int64', length=682)}
survived  gender
A         female    339
          male      161
D         female    127
          male      682
dtype: int64

In [32]:
idx = df1.survived == 'A'
p = df1[idx]
r = p.groupby(['gender'])
print(r.age.max())

gender
female    76.0
male      80.0
Name: age, dtype: float64